[
    {
        "title": "Scikit-Learn",
        "date": "Jan 2022 - Apr 2022",
        "thumbnail": "/assets/scikit-learn.png",
        "short_desc": "An open-source library for machine learning built in Python.",
        "images": [
            {
                "image": "/assets/scikit-learn.png",
                "alt": "Scikit Learn logo"
            },
            {
                "image": "/assets/fit.png",
                "alt": "Bisecting K-Means Fit"
            },
            {
                "image": "/assets/predicted.png",
                "alt": "Bisecting K-Means Predict"
            }
        ],
        "long_desc": "During my 4th year winter semester, my engineering large software systems had us split into groups to contribute to the open source Scikit-Learn library. My group and I resolved small bugs ranging from formatting issues in regression models to inaccurate predictions in algorithms.\n\n Our largest and most difficult contribution was implementing a entirely new regression model using the bisecting k-means algorithm. To this end, we had to conduct research on the algorithm, and follow Scikit-Learn's existing design principles.\n\n I implemented the majority of the new model's estimator method using Numpy methods and arrays. Together with the rest of my team, we touched up on implementation details, fixing bugs and resolving edge cases while testing. As a result, we managed to achieve 90% prediction accuracy with our model.",
        "link": "https://github.com/ajz2000/scikit-learn",
        "tags": [
            {"tag": "Python", "badge": "badge-primary"},
            {"tag": "Numpy", "badge": "badge-secondary"},
            {"tag": "Machine Learning", "badge": "badge-success"},
            {"tag": "Duck Typing", "badge": "badge-info"},
            {"tag": "Scrum", "badge": "badge-dark"}
        ]
    },
    {
        "title": "Find Dining",
        "date": "Jan 2021 - Apr 2021",
        "thumbnail": "/assets/find_dining_logo_name.png",
        "short_desc": "An online promotion platform for Scarborough restaurants to share their stories.",
        "images": [
            {
                "image": "/assets/find_dining_logo_name.png",
                "alt": "Find Dining logo"
            },
            {

                "image": "/assets/finddining_home.png",
                "alt": "Find Dining homepage"
            },
            {
                "image": "/assets/finddining_login.png",
                "alt": "Find Dining login page"
            },
            {
                "image": "/assets/finddining_articles.png",
                "alt": "Find Dining media page"
            },
            {
                "image": "/assets/finddining_article.png",
                "alt": "Find Dining article"
            },
            {
                "image": "/assets/finddining_browse.png",
                "alt": "Find Dining restaurants browse page"
            },
            {
                "image": "/assets/finddining_restaurant.png",
                "alt": "Find Dining restaurant profile page"
            },
            {
                "image": "/assets/finddining_dish.png",
                "alt": "Find Dining specials dish page"
            },
            {
                "image": "/assets/finddining_notes.png",
                "alt": "Find Dining extra restaurant info page"
            },
            {
                "image": "/assets/finddining_profile.png",
                "alt": "Find Dining user profile page"
            },
            {
                "image": "/assets/finddining_newsletter.png",
                "alt": "Find Dining newsletter signup page"
            }
        ],
        "long_desc": "During my 2nd co-op workterm at UTSC the BRIDGE, I worked on the Find Dining project as a full stack web developer. Find Dining is a website for promoting the culinary entrepreneurs of Scarborough, celebrating their cultural diversity and innovations through the food. Restaurants can share the history of their founding in Scarborough and stories behind their dishes. This project is backed by the City of Toronto, UTSC, and Centennial College.\n\nAs a member of the co-op developer team, I served mainly in backend development, however due to my flexibility and experience, I was able to switchover to frontend or deployment work whenever and wherever needed. It was because of this that I was seen as the unofficial tech lead of the project. The web-app's built on a Django+Angular framework with MongoDB as its database. We had a 4-month window to get the website up and running with all the features the City wanted to include as part of the MVP.\n\nDuring those 4 months, I had to learn new Django functionalities, the Angular framework, how to deploy using Docker+Nginx, and how to integrate Django with GCP services. We even had to scrap the whole prototype and start anew halfway through the term, because an advising Professor said the prototype made by the previous team was incredibly messy. This sent mass panic through the entire team, but we managed to overcome this by splitting up and taking on separate responsibilities. By the end of the term, we had an improved web-app with better architecture, better security, better performance, and better user-experience.\n\nThis was by far, the most involved I've ever been in any technical position I've held. Everything I did for this project, I was able to see the big picture and was able to see the feedback from the stakeholders. I even had a say in how to design certain features or whether or not those functions were possible in the time constraints. Working in an entrepreneurial environment is a big difference from working in a big company setting.",
        "link": "https://github.com/MochiTarts/Find-Dining-The-Bridge",
        "website": "https://finddining.ca",
        "tags": [
            {"tag": "Python", "badge": "badge-primary"},
            {"tag": "Django", "badge": "badge-secondary"},
            {"tag": "Angular", "badge": "badge-success"},
            {"tag": "Docker", "badge": "badge-info"},
            {"tag": "Git", "badge": "badge-dark"},
            {"tag": "Scrum", "badge": "badge-warning"},
            {"tag": "MongoDB", "badge": "badge-primary"},
            {"tag": "GCP", "badge": "badge-secondary"}
        ]
    },
    {
        "title": "U-Impactify",
        "date": "Sept 2020 - Dec 2020",
        "thumbnail": "/assets/uimpact_logo.png",
        "short_desc": "An online learning and consulting platform targted to Social Organizations.",
        "images": [
            {
                "image": "/assets/uimpact_logo.png",
                "alt": "U-Impactify logo"
            }
        ],
        "long_desc": "A web-app built by myself with a team of 6 developers. This online learning platform is something akin to the Udemy website, where users can register and select courses offered by our site. Most of the courses are be geared towards skills that would help Social Initiatives improve their operations and activities. In addition to that, users can register as consultants to offer their services to seeking organizations, or create courses for other users to take. Social Initiatives may also post volunteer/employment opportunities on our site as well.\n\nThis project was built with Java Spring Boot as the backend framework and ReactJS as the frontend framework. We used a PostgreSQL relational database to store our web app's information. I mainly worked on the backend and built APIs and services for the frontend team to use that would either create, modify, obtain, or remove records from the database.\n\nBy the end of the semester, my team and I had one of the most complete and well-done MVPs our supervising TA have seen. And I have honed a new set of skills in backend development + API creation, and am excited to use them for future opportunities.",
        "link": "https://github.com/MochiTarts/coding-lads-uimpactify",
        "tags": [
            {"tag": "Java", "badge": "badge-primary"},
            {"tag": "Postgres", "badge": "badge-secondary"},
            {"tag": "Spring Boot", "badge": "badge-success"},
            {"tag": "React", "badge": "badge-info"},
            {"tag": "Scrum", "badge": "badge-dark"},
            {"tag": "Relational Models", "badge": "badge-warning"}
        ]
    },
    {
        "title": "Doodlejump",
        "date": "Dec 2020",
        "thumbnail": "/assets/doodlejump_start_copy.png",
        "short_desc": "A MIPS coded assembly project that is based the classic Doodlejump game.",
        "images": [
            {
                "image": "/assets/doodlejump_start.png",
                "alt": "Start screen of doodlejump game"
            },
            {
                "image": "/assets/doodlejump_instructions.png",
                "alt": "Instructional guide of doodlejump game"
            },
            {
                "image": "/assets/doodlejump_easy.png",
                "alt": "Easy level of doodlejump game"
            },
            {
                "image": "/assets/doodlejump_features.png",
                "alt": "Bombs, boosts, and shields in doodlejump game"
            },
            {
                "image": "/assets/doodlejump_end.png",
                "alt": "End screen of doodlejump game"
            },
            {
                "image": "/assets/doodlejump_medium.png",
                "alt": "Medium level of doodlejump game"
            },
            {
                "image": "/assets/doodlejump_shield.png",
                "alt": "Shielded doodler in doodlejump game"
            },
            {
                "image": "/assets/doodlejump_hard.png",
                "alt": "Hard level of doodlejump game"
            },
            {
                "image": "/assets/doodlejump_hard_bomb.png",
                "alt": "Doodler close to bomb in doodlejump game"
            }
        ],
        "long_desc": "For the final project in my computer organization course, I had to make a game similar to Doodlejump using assembly code. I had to use concepts taught in class and apply them while coding the game, such as registers, memory cache, machine code, and general MIPS programming knowledge.\n\nThe most difficult part of making this game is translating logic to assembly code and keeping everything organized. My process for overcoming this is creating flow charts, pseudocode for different parts of my game, and then turning those pseudocode sections into MIPS code. The end result is a simple (and rather enjoyable) platform jumping game that managed to impress the marking TAs so much, it received bonus marks.\n\nMIPS coding is definitely something that is not easy to get the hang of, especially since it disrupts my usual flow of logic, but thanks to smart planning and organization, I managed to get past this obstacle. I still play this game every so often to this day.",
        "link": "https://github.com/MochiTarts/Doodlejump-CSCB58",
        "tags": [
            {"tag": "MIPS", "badge": "badge-primary"},
            {"tag": "Assembly", "badge": "badge-secondary"}
        ]
    },
    {
        "title": "Android Shopping App",
        "date": "Nov 2019 - Dec 2019",
        "thumbnail": "/assets/androidapp_store.png",
        "short_desc": "A simple functional shopping app made for Android phones.",
        "images": [
            {
                "image": "/assets/androidapp_login.png",
                "alt": "Login of android app"
            },
            {
                "image": "/assets/androidapp_store.png",
                "alt": "Store display of android app"
            },
            {
                "image": "/assets/androidapp_cart.png",
                "alt": "Customer's shopping cart of android app"
            },
            {
                "image": "/assets/androidapp_checkout.png",
                "alt": "Checkout screen of android app"
            },
            {
                "image": "/assets/androidapp_admin.png",
                "alt": "Admin screen of android app"
            },
            {
                "image": "/assets/androidapp_employee.png",
                "alt": "Employee screen of android app"
            },
            {
                "image": "/assets/androidapp_restock.png",
                "alt": "Restock screen of android app"
            }
        ],
        "long_desc": "At the end of my second-year fall semester, my software design course had us develop an Android app for our culminating project. This was first time I ever worked in a scrum team. Using Android Studio and all the Java skills and design patterns taught in class, my team and I managed to create a working shop app that allowed customers to buy items, employees to restock items, and admins to view activity history. Those are just some of the many features we implemented in this app.\n\nFor this app, I had to learn Android Studio and how to apply the MVC model while making different app components. From retrieving data from the SQLite database, to reading data from the database and displaying it with a beautiful UI. Also at the beginning of the project, my team and I decided to use my prototype solution as the starting point of our app. Since it was the cleanest and most-finished out of all of ours.\n\nI am grateful for the hardworking capabilities of my team and myself. We were able to deliver a finished working product despite losing a teammate halfway through the development process, and were able to add an extra bonus feature within the final hours on submission night. Thanks to this experience, I have learned how to work in an Agile environment, the development of Android apps, and the importance of team communication.",
        "link": "https://github.com/MochiTarts/CSCB07AndroidProject",
        "tags": [
            {"tag": "Java", "badge": "badge-primary"},
            {"tag": "Android Studio", "badge": "badge-secondary"},
            {"tag": "SQLite", "badge": "badge-success"},
            {"tag": "Scrum", "badge": "badge-info"},
            {"tag": "SVN (TortoiseSVN)", "badge": "badge-dark"},
            {"tag": "MVC model", "badge": "badge-warning"}
        ]
    },
    {
        "title": "Mood",
        "date": "Nov 2019",
        "thumbnail": "/assets/mood.jpeg",
        "short_desc": "A sentiment analysis web app that will generate films, music, and gifs according to your mood.",
        "images": [
            {
                "image": "/assets/mood.jpeg",
                "alt": "Landing page of mood web app"
            },
            {
                "image": "/assets/mood_demo.jpeg",
                "alt": "Detecting a person's mood using the built-in emotion detector"
            },
            {
                "image": "/assets/mood_results.jpeg",
                "alt": "Results page of a surprised mood"
            },
            {
                "image": "/assets/mood_moreresults.jpeg",
                "alt": "Full results page of a fearful mood"
            }
        ],
        "long_desc": "I attended the Hack Western 6 hackathon in winter 2019. There, I and a team of four people (myself included), worked on a web app that was able to detect one's current mood, and would generate an endless list of movies and gifs, and select one song, that would help this person with how they're feeling. We made this using various APIs for getting the desired movies, gifs, and songs. Javascript and nodejs for backend purposes. Bootstrap, HTML, and CSS for making the frontend. And we built a custom API that allows us to communicate between backend and frontend.\n\nThis was by far, the biggest project I've worked on at a hackathon. It proves to me that with a clear end goal and strong dedication, things can be done in a limited amount of time. I had a lot of fun attending this hackathon and learned a lot of skills that proved to be helpful during my co-op term at UTSC the Bridge.",
        "link": "https://devpost.com/software/mood-o67ce1",
        "tags": [
            {"tag": "Javascript", "badge": "badge-primary"},
            {"tag": "Node.js", "badge": "badge-secondary"},
            {"tag": "Rest APIs", "badge": "badge-success"},
            {"tag": "HTML/CSS", "badge": "badge-info"},
            {"tag": "Bootstrap", "badge": "badge-dark"},
            {"tag": "Standard Library", "badge": "badge-warning"},
            {"tag": "Sentiment Analysis", "badge": "badge-primary"}
        ]
    },
    {
        "title": "Old Portfolio Website",
        "date": "Sept 2019",
        "thumbnail": "/assets/Portfolio_website.jpeg",
        "short_desc": "The previous portfolio website I created to present my skills, projects, and work experience.",
        "images": [
            {
                "image": "/assets/Portfolio_website.jpeg",
                "alt": "Landing page of old portfolio website"
            }
        ],
        "long_desc": "While job-searching for my first co-op term, I decided to update my portfolio website. The last time I ever touched it was in my senior year of high school. Now that I'm a university student studying computer science, I decided to make my website reflect that fact. This was made using pure HTML, CSS, and JavaScript, with the AOS CSS library for animations. This was also the first time I ever used flex layouts, so I took full advantage of their responsiveness and put more effort into making my site more mobile-friendly.\n\nThis site is still up and running, but I will no longer update there anymore. Since I have a newer site (this one!) to represent my portfolio.",
        "link": "https://github.com/MochiTarts/MochiTarts.github.io-old-",
        "website": "https://mochitarts.github.io/MochiTarts.github.io-old-/",
        "tags": [
            {"tag": "HTML/CSS", "badge": "badge-primary"},
            {"tag": "Javascript", "badge": "badge-secondary"}
        ]
    },
    {
        "title": "Heir to the Throne",
        "date": "Mar 2017 - Apr 2017",
        "thumbnail": "/assets/game.jpeg",
        "short_desc": "A point-&-click adventure game made using JavaScript, sessionStorage, and HTML/CSS.",
        "images": [
            {
                "image": "/assets/game.jpeg",
                "alt": "Opening page of Heir to the Throne"
            },
            {
                "image": "/assets/game_hallway.png",
                "alt": "Location choice page of Heir to the Throne"
            },
            {
                "image": "/assets/game_room_clues.png",
                "alt": "Clue on mirror of a room"
            },
            {
                "image": "/assets/game_room_no_clues.png",
                "alt": "Clue on broken mirror of a room"
            },
            {
                "image": "/assets/game_royal_children.png",
                "alt": "Page displaying profile of the royal children and clues gathered"
            },
            {
                "image": "/assets/game_barracks_secret.png",
                "alt": "Secret area in barracks room of game"
            },
            {
                "image": "/assets/game_secret_room_heir.png",
                "alt": "Secret room where heir is revealed"
            },
            {
                "image": "/assets/game_dungeon_secret.png",
                "alt": "Secret area in dungeon room of game"
            },
            {
                "image": "/assets/game_quick_time.png",
                "alt": "Quick time events of dungeon room"
            },
            {
                "image": "/assets/game_quick_time_success.png",
                "alt": "Successful quick time events of dungeon room"
            },
            {
                "image": "/assets/game_secret_out.png",
                "alt": "Secret room where outsider is revealed"
            },
            {
                "image": "/assets/game_arrest_out.png",
                "alt": "Arresting the outsider"
            },
            {
                "image": "/assets/game_good_end.png",
                "alt": "Good ending of the game"
            },
            {
                "image": "/assets/game_out_poison.png",
                "alt": "Being offered water by the outsider"
            },
            {
                "image": "/assets/game_poisoned.png",
                "alt": "Ending where you get poisoned by the outsider"
            },
            {
                "image": "/assets/game_bad_end.png",
                "alt": "Ending where you arrest the heir to the throne"
            }
        ],
        "long_desc": "One of my earliest computer-programming projects was Heir to the Throne. This is first game I created using JavaScript, HTML, and CSS and I created it during grade 11 high school. I was a huge video game nerd and always dreamed of one day developing my own game or working for a large game company.\n\nThis game is a point-and-click adventure game where the player can explore many locations on a map by clicking on its image. The purpose of this game is to find out the traitor among the King's children and arrest them before they either kill the player or the true heir to the throne. In certain areas, there are clues that pertain to the traitor's or the heir's identity and the player can cross-reference those clues to each of the King's children's profiles. The player wins if they arrest the traitor and loses if they arrest the true heir or gets killed by the traitor.\n\nBeing a huge video game fan and avid dreamer made me realize how much I want to create games of my own one day. This project in my first ever computer science course in high school, was definitely the pushing factor towards me pursuing computer science in university. It made me realize that I had an affinity for programming and that despite how difficult and frustrating it'd sometimes get, I never gave up. Compared to other professions, I could see myself enjoying a life of designing and coding.",
        "link": "https://github.com/MochiTarts/HeirToTheThrone",
        "tags": [
            {"tag": "Javascript", "badge": "badge-primary"},
            {"tag": "HTML/CSS", "badge": "badge-secondary"},
            {"tag": "Web-made game", "badge": "badge-success"}
        ]
    }
]